import Logo from "../Components/logo";
import PageHeaders from "../Components/Common/pageHeaders";

function About() {
  return (
    <div className="container my-5 pb-5" dir="rtl">
      <PageHeaders
        title={<>אודות {<Logo />}</>}
        description={
          <div className="text-center my-5 text-end">
            <h1>הדרך הקלה להתחבר לעסקים ולקוחות חדשים!</h1>
            <p>
              האתר שלנו מציע לכם פלטפורמה חכמה ומתקדמת לחיפוש עסקים מכל התחומים,
              או לפרסום העסק שלכם וחשיפתו בפני קהל רחב.
            </p>

            <div className="my-4">
              <h2>למשתמשים רשומים</h2>
              <p>
                הרשמה לאתר פותחת בפניכם עולם של אפשרויות שמאפשרות לכם ליצור
                אינטראקציה אישית עם העסקים באתר:
              </p>
              <ul className="list-unstyled">
                <li>הוספת לייקים לעסקים ושמירתם בעמוד המועדפים שלכם ❤️</li>
                <li>שמירת עסקים למועדפים לגישה מהירה 💾</li>
                <li>צפייה באזורי עסקים ומפת ניווט להגעה נוחה 🗺️</li>
              </ul>

              <h2>למשתמשים בעלי עסקים</h2>
              <ul className="list-unstyled">
                <li>פרסום ועריכת עסק בלחיצת כפתור 🆕</li>
                <li>מעקב אחרי לייקים וניהול כרטיסי עסקים ✏️</li>
                <li>מחיקת כרטיס העסק במידת הצורך 🗑️</li>
              </ul>

              <h2>משתמשים שאינם רשומים</h2>
              <p>
                משתמשים לא רשומים יכולים לצפות בפרטי עסקים, אך לא לשמור אותם או
                להוסיף לייקים.
              </p>
            </div>

            <div className="my-4">
              <h2>החזון שלנו</h2>
              <p>
                אנו שואפים לחבר בין עסקים ללקוחות בצורה פשוטה ונגישה, תוך מתן
                כלים ייחודיים להגדלת החשיפה וההתקשרות.
              </p>
            </div>
          </div>
        }
      />
    </div>
  );
}

export default About;
